by_week/week5/day4/forms_and_such/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.sort_by{|p| p.views.count}.reverse
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Old Man's War"], ["body", "John Scalzi's first major novel."], ["created_at", "2015-11-04 15:43:25.254142"], ["updated_at", "2015-11-04 15:43:25.254142"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "The Damn Filthy Ape and The Two Travelers"], ["updated_at", "2015-11-05 15:04:50.680924"], ["id", 1]]