by_week/week8/day4/lego_tracker/app/controllers/lego_sets_controller.rb

  def create
    @lego_set = LegoSet.new(lego_set_params)
    if @lego_set.save
---
INSERT INTO "lego_sets" ("name", "cost", "date_procured", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Death Star"], ["cost", 40000], ["date_procured", "2015-12-25"], ["created_at", "2015-12-03 16:21:39.082221"], ["updated_at", "2015-12-03 16:21:39.082221"]]

  def index
    @lego_sets = LegoSet.all
---
SELECT "lego_sets".* FROM "lego_sets"